In [21]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

/kaggle/input/nek-310-lecture-2/Spend.xlsx
/kaggle/input/nek-310-lecture-2/Gig.xlsx

<h3>Import the datasets "Gig" and "Spend"</h3>

In [22]:
GIG_data = pd.read_excel('/kaggle/input/nek-310-lecture-2/Gig.xlsx', sheet_name='Blad1')

SPEND_data = pd.read_excel('/kaggle/input/nek-310-lecture-2/Spend.xlsx', sheet_name='Blad1')

<h3>Check what is in the datasets</h3>

In [8]:
GIG_data.tail(20)

     EmployeeID   Wage      Industry         Job
480         481  46.45    Automotive    Engineer
481         482  47.00    Automotive    Engineer
482         483  47.18  Construction   Sales Rep
483         484  41.26  Construction  Accountant
484         485  32.35  Construction       Other
485         486  40.18  Construction  Programmer
486         487  27.18  Construction  Consultant
487         488  40.62  Construction  Accountant
488         489  42.18    Automotive    Engineer
489         490  48.26  Construction   Sales Rep
490         491  47.72          Tech    Engineer
491         492  45.82    Automotive    Engineer
492         493  43.14  Construction    Engineer
493         494  35.16  Construction   Sales Rep
494         495  44.42  Construction  Consultant
495         496  45.76    Automotive    Engineer
496         497  41.89    Automotive  Consultant
497         498  30.47  Construction  Consultant
498         499  24.89  Construction   Sales Rep
499         500  43.13           NaN   Sales Rep

In [ ]:
SPEND_data.info()

<h3>Joining Gig and Spend on Employee_ID and ID</h3>

In [9]:
GIG_SPEND_data=pd.merge(GIG_data, SPEND_data, left_on='EmployeeID', right_on='ID')

<h3>Check that join worked as expected</h3>

In [18]:
GIG_SPEND_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmployeeID   500 non-null    int64
 1   Wage         500 non-null    float64
 2   Industry     492 non-null    object
 3   Job          487 non-null    object
 4   ID           500 non-null    int64
 5   OwnHome      497 non-null    object
 6   OwnCar       497 non-null    object
 7   FoodSpend    500 non-null    float64
 8   TravelSpend  499 non-null    float64
dtypes: float64(3), int64(2), object(4)
memory usage: 35.3+ KB

<h3>As EmployeeID and ID contain the same data we decide to drop ID</h3>

In [23]:
GIG_SPEND_data.drop(columns=['ID'])

,EmployeeID,Wage,Industry,Job,OwnHome,OwnCar,FoodSpend,TravelSpend
0,1,32.81,Construction,Analyst,Yes,Yes,5472.43,827.40
1,2,46.00,Automotive,Engineer,No,Yes,9130.73,863.55
2,3,43.13,Construction,Sales Rep,No,Yes,4450.67,1180.05
3,4,48.09,Automotive,Other,No,Yes,5020.72,755.70
4,5,43.62,Automotive,Accountant,No,Yes,3408.11,851.40
...,...,...,...,...,...,...,...,...
495,496,45.76,Automotive,Engineer,Yes,No,3787.29,2058.75
496,497,41.89,Automotive,Consultant,No,No,6460.84,3852.90
497,498,30.47,Construction,Consultant,No,No,3585.86,2251.95
498,499,24.89,Construction,Sales Rep,Yes,No,1833.95,2000.25
499,500,43.13,NaN,Sales Rep,No,No,6205.97,3667.50

<h3>Another option would be to rename EmployeeID as ID or ID as EmployeeID before the join</h3>

In [24]:
GIG_data_2=GIG_data.rename(columns={'EmployeeID':'ID'})

In [14]:
GIG_data_2.columns

Index(['ID', 'Wage', 'Industry', 'Job'], dtype='object')

In [15]:
GIG_SPEND_2_data=pd.merge(GIG_data_2, SPEND_data, how="left", on=["ID"])

In [19]:
GIG_SPEND_2_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           500 non-null    int64
 1   Wage         500 non-null    float64
 2   Industry     492 non-null    object
 3   Job          487 non-null    object
 4   OwnHome      497 non-null    object
 5   OwnCar       497 non-null    object
 6   FoodSpend    500 non-null    float64
 7   TravelSpend  499 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 31.4+ KB

<h3>There are different types of joins, inner and outer, from the left and from the right. Let's see how they differ. In order to display the differences we drop rows with missing values from the datastets.</h3>

In [25]:
GIG_data_3=GIG_data_2.dropna()

SPEND_data_3=SPEND_data.dropna()

In [26]:
GIG_data_3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 479 entries, 0 to 498
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ID        479 non-null    int64
 1   Wage      479 non-null    float64
 2   Industry  479 non-null    object
 3   Job       479 non-null    object
dtypes: float64(1), int64(1), object(2)
memory usage: 18.7+ KB

In [27]:
SPEND_data_3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 493 entries, 0 to 499
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           493 non-null    int64
 1   OwnHome      493 non-null    object
 2   OwnCar       493 non-null    object
 3   FoodSpend    493 non-null    float64
 4   TravelSpend  493 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 23.1+ KB

<h3>Let's see what happens if we do an outer join of GIG and SPEND</h3>

In [28]:
GIG_SPEND_4=GIG_data_3.merge(SPEND_data_3, how='outer', on='ID')

GIG_SPEND_4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           500 non-null    int64
 1   Wage         479 non-null    float64
 2   Industry     479 non-null    object
 3   Job          479 non-null    object
 4   OwnHome      493 non-null    object
 5   OwnCar       493 non-null    object
 6   FoodSpend    493 non-null    float64
 7   TravelSpend  493 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 31.4+ KB

In [29]:
GIG_SPEND_4.isna().sum()

ID              0
Wage           21
Industry       21
Job            21
OwnHome         7
OwnCar          7
FoodSpend       7
TravelSpend     7
dtype: int64

<h3>What about an inner join?</h3>

In [30]:
GIG_SPEND_5=GIG_data_3.merge(SPEND_data_3, how='inner', on='ID')

GIG_SPEND_5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 472 entries, 0 to 471
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           472 non-null    int64
 1   Wage         472 non-null    float64
 2   Industry     472 non-null    object
 3   Job          472 non-null    object
 4   OwnHome      472 non-null    object
 5   OwnCar       472 non-null    object
 6   FoodSpend    472 non-null    float64
 7   TravelSpend  472 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 29.6+ KB

In [31]:
GIG_SPEND_5.isna().sum()

ID             0
Wage           0
Industry       0
Job            0
OwnHome        0
OwnCar         0
FoodSpend      0
TravelSpend    0
dtype: int64

<h3>So the outer join is like a union and the inner is like an instersection (remember Jaggia & Kelly chapter 4...)</h3>

<h3>What about left and right?</h3>

In [32]:
GIG_SPEND_6=GIG_data_3.merge(SPEND_data_3, how='left', on='ID')

GIG_SPEND_6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 479 entries, 0 to 478
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           479 non-null    int64
 1   Wage         479 non-null    float64
 2   Industry     479 non-null    object
 3   Job          479 non-null    object
 4   OwnHome      472 non-null    object
 5   OwnCar       472 non-null    object
 6   FoodSpend    472 non-null    float64
 7   TravelSpend  472 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 30.1+ KB

In [33]:
GIG_SPEND_7=GIG_data_3.merge(SPEND_data_3, how='right', on='ID')

GIG_SPEND_7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 493 entries, 0 to 492
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           493 non-null    int64
 1   Wage         472 non-null    float64
 2   Industry     472 non-null    object
 3   Job          472 non-null    object
 4   OwnHome      493 non-null    object
 5   OwnCar       493 non-null    object
 6   FoodSpend    493 non-null    float64
 7   TravelSpend  493 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 30.9+ KB

<h3>Filter out the house owners</h3>

In [34]:
GIG_SPEND_HOUSE_data=GIG_SPEND_data[GIG_SPEND_data['OwnHome']=='Yes']

In [35]:
GIG_SPEND_HOUSE_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 133 entries, 0 to 498
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmployeeID   133 non-null    int64
 1   Wage         133 non-null    float64
 2   Industry     130 non-null    object
 3   Job          132 non-null    object
 4   ID           133 non-null    int64
 5   OwnHome      133 non-null    object
 6   OwnCar       132 non-null    object
 7   FoodSpend    133 non-null    float64
 8   TravelSpend  133 non-null    float64
dtypes: float64(3), int64(2), object(4)
memory usage: 10.4+ KB

<h3>Create an indicator variable for wage above the median</h3>

In [36]:
GIG_SPEND_data['Above_median_wage']=(GIG_SPEND_data['Wage']>GIG_SPEND_data['Wage'].median())

<h3>Create a crosstable for OwnHome and Above median wage</h3>

In [37]:
pd.crosstab(GIG_SPEND_data['Above_median_wage'],GIG_SPEND_data['OwnHome'])

OwnHome             No  Yes
Above_median_wage
False              180   68
True               184   65

<h3>Descriptive statistics for FoodSpend and TravelSpend grouped by above median wage</h3>

In [38]:
GIG_SPEND_data.groupby(['Above_median_wage'])['TravelSpend'].describe()

,count,mean,std,min,25%,50%,75%,max
Above_median_wage,,,,,,,,
False,250.0,2394.831000,1066.445987,673.35,1715.25,2182.95,3124.875,5616.0
True,249.0,2415.753614,1206.522030,637.05,1491.45,2169.00,3163.500,6030.3

In [39]:
GIG_SPEND_data.groupby(['Above_median_wage'])['FoodSpend'].describe()

,count,mean,std,min,25%,50%,75%,max
Above_median_wage,,,,,,,,
False,250.0,4424.91404,1798.184354,1550.16,2968.6125,4294.150,5504.9250,9978.49
True,250.0,4415.64100,1686.093491,1771.85,3099.1575,4120.315,5408.7075,10000.00